﻿//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2013, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
//**********************************************************************
//<AMI_FHDR_START>
//
// Name:  <NCT6776Setup.uni>
//
// Description: SIO Form String Definitions
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"

//If customer define the common logical device by themselves, add here.
#string STR_NCT6776_SIO_FORM                        #language eng "NCT6776 Super IO Configuration"
#string STR_NCT6776_SIO_FORM_HELP                   #language eng "System Super IO Chip Parameters."
#string STR_NCT6776_SIO_PROMPT                      #language eng "Super IO Chip"
#string STR_NCT6776                                 #language eng "NCT6776"
//
//Serial 1/2 Settings
//
//
//COMB Settings
//
#string STR_NCT6776_COMB_MODE1                      #language eng "Standard Serial Port Mode"
#string STR_NCT6776_COMB_MODE2                      #language eng "IrDA Active pulse 1.6 uS"
#string STR_NCT6776_COMB_MODE3                      #language eng "IrDA Active pulse 3/16 bit time"
#string STR_NCT6776_COMB_MODE4                      #language eng "ASKIR Mode"
//
//Parallel Settings
//
#string STR_NCT6776_PARALLEL_IO378_IRQ5             #language eng "IO=378h; IRQ=5;"
#string STR_NCT6776_PARALLEL_IO378_IRQX             #language eng "IO=378h; IRQ=5,6,7,9,10,11,12;"
#string STR_NCT6776_PARALLEL_IO278_IRQX             #language eng "IO=278h; IRQ=5,6,7,9,10,11,12;"
#string STR_NCT6776_PARALLEL_IO3BC_IRQX             #language eng "IO=3BCh; IRQ=5,6,7,9,10,11,12;"

#string STR_NCT6776_PARALLELE_IO378_778_IRQ5_DMA3   #language eng "IO=378h; IRQ=5; DMA=3;"
#string STR_NCT6776_PARALLELE_IO378_778_IRQX_DMAX   #language eng "IO=378h; IRQ=5,6,7,9,10,11,12; DMA=1,3;"
#string STR_NCT6776_PARALLELE_IO278_678_IRQX_DMAX   #language eng "IO=278h; IRQ=5,6,7,9,10,11,12; DMA=1,3;"
#string STR_NCT6776_PARALLELE_IO3BC_7BC_IRQX_DMAX   #language eng "IO=3BCh; IRQ=5,6,7,9,10,11,12; DMA=1,3;"

#string STR_NCT6776_PARALLEL_MODE0                  #language eng "STD Printer Mode"
#string STR_NCT6776_PARALLEL_MODE1                  #language eng "SPP Mode"
#string STR_NCT6776_PARALLEL_MODE2                  #language eng "EPP-1.9 and SPP Mode"
#string STR_NCT6776_PARALLEL_MODE3                  #language eng "EPP-1.7 and SPP Mode"
#string STR_NCT6776_PARALLEL_MODE4                  #language eng "ECP Mode"
#string STR_NCT6776_PARALLEL_MODE5                  #language eng "ECP and EPP 1.9 Mode"
#string STR_NCT6776_PARALLEL_MODE6                  #language eng "ECP and EPP 1.7 Mode"
#string STR_NCT6776_PARALLEL_MODE_HELP              #language eng "Change the Printer Port mode."
//
//CIR Settings
//
#string STR_NCT6776_CIR_FORM                        #language eng "CIR Controller Configuration"
#string STR_NCT6776_CIR_FORM_HELP                   #language eng "Set Parameters of CIR Controller (CIR)"
#string STR_NCT6776_CIR_PROMPT                      #language eng "CIR Controller"
#string STR_NCT6776_CIR_PROMPT_HELP                 #language eng "Enable or Disable CIR Controller"
#string STR_NCT6776_CIR_SETTINGS0                   #language eng "IO=3E0h; IRQ=10;"
#string STR_NCT6776_CIR_SETTINGS1                   #language eng "IO=3E0h; IRQ=3,4,5,6,7,9,10,11,12;"
#string STR_NCT6776_CIR_CONFIG_VALUE                #language eng "Reset Required"
    
//#string <string name>                   #language eng ""
//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2013, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************
